<!-- add-pr-comment:add-pr-comment -->

## Terraform github repositories plan
```
module.ministryofjustice-test.module.test_tamf_repo_test_org.github_repository.default: Preparing import... [id=test-tamf-repo-test-org]
data.github_team.test_team_access: Reading...
module.ministryofjustice-test.module.test-repo-levg.github_repository.default: Preparing import... [id=test-repo-levg]
data.github_team.operations_engineering_test: Reading...
module.ministryofjustice-test.module.test-repo-levg.github_repository.default: Refreshing state... [id=test-repo-levg]
module.ministryofjustice-test.module.test_tamf_repo_test_org.github_repository.default: Refreshing state... [id=test-tamf-repo-test-org]
data.github_team.operations_engineering: Reading...
module.ministryofjustice.module.operations-engineering-runbooks.github_repository.default: Preparing import... [id=operations-engineering-runbooks]
module.ministryofjustice.module.operations-engineering-kpi-dashboard.github_repository.default: Preparing import... [id=operations-engineering-kpi-dashboard]
module.ministryofjustice.module.operations-engineering.github_repository.default: Preparing import... [id=operations-engineering]
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.github_repository.default: Preparing import... [id=operations-engineering-documentation-browser-extension]
module.ministryofjustice.module.terraform-github-repository.github_repository.default: Preparing import... [id=terraform-github-repository]
module.ministryofjustice.module.operations-engineering-kpi-dashboard.github_repository.default: Refreshing state... [id=operations-engineering-kpi-dashboard]
module.ministryofjustice.module.operations-engineering.github_repository.default: Refreshing state... [id=operations-engineering]
module.ministryofjustice.module.operations-engineering-runbooks.github_repository.default: Refreshing state... [id=operations-engineering-runbooks]
module.ministryofjustice.module.terraform-github-repository.github_repository.default: Refreshing state... [id=terraform-github-repository]
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.github_repository.default: Refreshing state... [id=operations-engineering-documentation-browser-extension]
data.github_team.test_team_access: Read complete after 1s [id=9472191]
module.ministryofjustice.module.operations-engineering-cloud-platform-namespace.github_repository.default: Preparing import... [id=operations-engineering-cloud-platform-namespace]
module.ministryofjustice.module.operations-engineering-cloud-platform-namespace.github_repository.default: Refreshing state... [id=operations-engineering-cloud-platform-namespace]
module.ministryofjustice.module.operations-engineering-user-guide.github_repository.default: Preparing import... [id=operations-engineering-user-guide]
module.ministryofjustice.module.operations-engineering-user-guide.github_repository.default: Refreshing state... [id=operations-engineering-user-guide]
module.ministryofjustice.module.operations-engineering-github-actions-dashboard.github_repository.default: Preparing import... [id=operations-engineering-github-actions-dashboard]
module.ministryofjustice.module.operations-engineering-github-actions-dashboard.github_repository.default: Refreshing state... [id=operations-engineering-github-actions-dashboard]
module.ministryofjustice.module.operations-engineering-support-metadata.github_repository.default: Preparing import... [id=operations-engineering-support-metadata]
module.ministryofjustice.module.operations-engineering-support-metadata.github_repository.default: Refreshing state... [id=operations-engineering-support-metadata]
data.github_team.operations_engineering_test: Read complete after 2s [id=9456244]
module.ministryofjustice.module.github-actions.github_repository.default: Preparing import... [id=github-actions]
module.ministryofjustice.module.github-actions.github_repository.default: Refreshing state... [id=github-actions]
module.ministryofjustice.module.terraform-aws-mtasts.github_repository.default: Preparing import... [id=terraform-aws-mtasts]
module.ministryofjustice.module.terraform-aws-mtasts.github_repository.default: Refreshing state... [id=terraform-aws-mtasts]
module.ministryofjustice.module.operations-engineering-certificate-renewal.github_repository.default: Preparing import... [id=operations-engineering-certificate-renewal]
module.ministryofjustice.module.operations-engineering-certificate-renewal.github_repository.default: Refreshing state... [id=operations-engineering-certificate-renewal]
data.github_team.operations_engineering: Read complete after 4s [id=4192115]
module.ministryofjustice.module.operations-engineering-find-a-github-repository-owner.github_repository.default: Preparing import... [id=operations-engineering-find-a-github-repository-owner]
module.ministryofjustice.module.operations-engineering-find-a-github-repository-owner.github_repository.default: Refreshing state... [id=operations-engineering-find-a-github-repository-owner]
module.ministryofjustice-test.module.test-repo-levg.github_branch_protection.default: Preparing import... [id=test-repo-levg]
module.ministryofjustice-test.module.test_tamf_repo_test_org.github_branch_protection.default: Preparing import... [id=R_kgDOLRPf2Q:main]
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.github_branch_protection.default: Preparing import... [id=operations-engineering-documentation-browser-extension]
module.ministryofjustice.module.operations-engineering-kpi-dashboard.github_branch_protection.default: Preparing import... [id=operations-engineering-kpi-dashboard]
module.ministryofjustice.module.terraform-github-repository.github_branch_protection.default: Preparing import... [id=terraform-github-repository]
module.ministryofjustice.module.operations-engineering.github_branch_protection.default: Preparing import... [id=operations-engineering]
module.ministryofjustice.module.operations-engineering-runbooks.github_branch_protection.default: Preparing import... [id=operations-engineering-runbooks]
module.ministryofjustice-test.module.test_tamf_repo_test_org.github_team_repository.maintain["9456244"]: Preparing import... [id=9456244:test-tamf-repo-test-org]
module.ministryofjustice-test.module.test_tamf_repo_test_org.github_team_repository.maintain["9456244"]: Refreshing state... [id=9456244:test-tamf-repo-test-org]
module.ministryofjustice.module.operations-engineering-runbooks.github_team_repository.admin["4192115"]: Preparing import... [id=4192115:operations-engineering-runbooks]
module.ministryofjustice.module.operations-engineering-runbooks.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-runbooks]
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.github_team_repository.admin["4192115"]: Preparing import... [id=4192115:operations-engineering-documentation-browser-extension]
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-documentation-browser-extension]
module.ministryofjustice.module.operations-engineering-kpi-dashboard.github_team_repository.admin["4192115"]: Preparing import... [id=4192115:operations-engineering-kpi-dashboard]
module.ministryofjustice.module.operations-engineering-kpi-dashboard.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-kpi-dashboard]
module.ministryofjustice-test.module.test_tamf_repo_test_org.github_team_repository.push["9472191"]: Preparing import... [id=9472191:test-tamf-repo-test-org]
module.ministryofjustice-test.module.test_tamf_repo_test_org.github_team_repository.push["9472191"]: Refreshing state... [id=9472191:test-tamf-repo-test-org]
module.ministryofjustice-test.module.test_tamf_repo_test_org.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLRPf2c4Cyrgo]
module.ministryofjustice.module.terraform-github-repository.github_team_repository.admin["4192115"]: Preparing import... [id=4192115:terraform-github-repository]
module.ministryofjustice.module.terraform-github-repository.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:terraform-github-repository]
module.ministryofjustice.module.operations-engineering.github_team_repository.admin["4192115"]: Preparing import... [id=4192115:operations-engineering]
module.ministryofjustice.module.operations-engineering.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering]
module.ministryofjustice.module.operations-engineering-cloud-platform-namespace.github_branch_protection.default: Preparing import... [id=operations-engineering-cloud-platform-namespace]
module.ministryofjustice.module.operations-engineering-cloud-platform-namespace.github_team_repository.admin["4192115"]: Preparing import... [id=4192115:operations-engineering-cloud-platform-namespace]
module.ministryofjustice.module.operations-engineering-cloud-platform-namespace.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-cloud-platform-namespace]
module.ministryofjustice.module.operations-engineering-github-actions-dashboard.github_branch_protection.default: Preparing import... [id=operations-engineering-github-actions-dashboard]
module.ministryofjustice.module.operations-engineering-github-actions-dashboard.github_team_repository.admin["4192115"]: Preparing import... [id=4192115:operations-engineering-github-actions-dashboard]
module.ministryofjustice.module.operations-engineering-github-actions-dashboard.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-github-actions-dashboard]
module.ministryofjustice.module.operations-engineering-support-metadata.github_branch_protection.default: Preparing import... [id=operations-engineering-support-metadata]
module.ministryofjustice.module.operations-engineering-support-metadata.github_team_repository.admin["4192115"]: Preparing import... [id=4192115:operations-engineering-support-metadata]
module.ministryofjustice.module.operations-engineering-support-metadata.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-support-metadata]
module.ministryofjustice.module.terraform-aws-mtasts.github_branch_protection.default: Preparing import... [id=terraform-aws-mtasts]
module.ministryofjustice.module.terraform-aws-mtasts.github_team_repository.admin["4192115"]: Preparing import... [id=4192115:terraform-aws-mtasts]
module.ministryofjustice.module.terraform-aws-mtasts.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:terraform-aws-mtasts]
module.ministryofjustice.module.operations-engineering-certificate-renewal.github_branch_protection.default: Preparing import... [id=operations-engineering-certificate-renewal]
module.ministryofjustice.module.operations-engineering-certificate-renewal.github_team_repository.admin["4192115"]: Preparing import... [id=4192115:operations-engineering-certificate-renewal]
module.ministryofjustice.module.operations-engineering-certificate-renewal.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-certificate-renewal]
module.ministryofjustice.module.operations-engineering-find-a-github-repository-owner.github_branch_protection.default: Preparing import... [id=operations-engineering-find-a-github-repository-owner]
module.ministryofjustice.module.operations-engineering-find-a-github-repository-owner.github_team_repository.admin["4192115"]: Preparing import... [id=4192115:operations-engineering-find-a-github-repository-owner]
module.ministryofjustice.module.operations-engineering-find-a-github-repository-owner.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-find-a-github-repository-owner]
module.ministryofjustice.module.operations-engineering-user-guide.github_branch_protection.default: Preparing import... [id=operations-engineering-user-guide]
module.ministryofjustice.module.operations-engineering-user-guide.github_team_repository.admin["4192115"]: Preparing import... [id=4192115:operations-engineering-user-guide]
module.ministryofjustice.module.operations-engineering-user-guide.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-user-guide]
module.ministryofjustice.module.github-actions.github_team_repository.admin["4192115"]: Preparing import... [id=4192115:github-actions]
module.ministryofjustice.module.github-actions.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:github-actions]
module.ministryofjustice.module.github-actions.github_branch_protection.default: Preparing import... [id=github-actions]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # module.ministryofjustice.module.github-actions.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "github-actions"
    }

  # module.ministryofjustice.module.github-actions.github_repository.default will be updated in-place
  # (imported from "github-actions")
  ~ resource "github_repository" "default" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        allow_update_branch         = false
      + archive_on_destroy          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "main"
        delete_branch_on_merge      = true
        description                 = "A collection of reusable GitHub Actions for the Ministry of Justice, designed to streamline and enhance workflows across our projects. • This repository is defined and managed in Terraform"
        etag                        = "W/\"5afb7f0f7f05dba311cce1f080f39f90f6d6a075ad585bf8154f1c58dc99faf9\""
        full_name                   = "ministryofjustice/github-actions"
        git_clone_url               = "git://github.com/ministryofjustice/github-actions.git"
        has_discussions             = false
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
        has_wiki                    = true
        html_url                    = "https://github.com/ministryofjustice/github-actions"
        http_clone_url              = "https://github.com/ministryofjustice/github-actions.git"
        id                          = "github-actions"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "github-actions"
        node_id                     = "MDEwOlJlcG9zaXRvcnkyMTUwNDI2MTg="
        primary_language            = "Python"
        private                     = false
        repo_id                     = 215042618
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:ministryofjustice/github-actions.git"
        svn_url                     = "https://github.com/ministryofjustice/github-actions"
        topics                      = [
            "operations-engineering",
        ]
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        pages {
            build_type = "legacy"
            custom_404 = false
            html_url   = "https://ministryofjustice.github.io/github-actions/"
            status     = "built"
            url        = "https://api.github.com/repos/ministryofjustice/github-actions/pages"

            source {
                branch = "main"
                path   = "/"
            }
        }

        security_and_analysis {
            secret_scanning {
                status = "enabled"
            }
            secret_scanning_push_protection {
                status = "enabled"
            }
        }
    }

  # module.ministryofjustice.module.github-actions.github_team_repository.admin["4192115"] will be imported
    resource "github_team_repository" "admin" {
        etag       = "W/\"e3e77e7463a777ec9aa2700f03d68221e5a5d61a40ee0532c742f9bb6f8ea228\""
        id         = "4192115:github-actions"
        permission = "admin"
        repository = "github-actions"
        team_id    = "4192115"
    }

  # module.ministryofjustice.module.operations-engineering.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "operations-engineering"
    }

  # module.ministryofjustice.module.operations-engineering.github_repository.default will be updated in-place
  # (imported from "operations-engineering")
  ~ resource "github_repository" "default" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        allow_update_branch         = false
      + archive_on_destroy          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "main"
        delete_branch_on_merge      = true
        description                 = "This repository is home to the Operations Engineering's tools and utilities for managing, monitoring, and optimising software development processes at the Ministry of Justice. • This repository is defined and managed in Terraform"
        etag                        = "W/\"d25bc6d0a1b95ed2afea2d704e7c1aebbe06a2052ab79b233df84ab5a0167dba\""
        full_name                   = "ministryofjustice/operations-engineering"
        git_clone_url               = "git://github.com/ministryofjustice/operations-engineering.git"
        has_discussions             = true
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
        has_wiki                    = true
        homepage_url                = "https://user-guide.operations-engineering.service.justice.gov.uk/"
        html_url                    = "https://github.com/ministryofjustice/operations-engineering"
        http_clone_url              = "https://github.com/ministryofjustice/operations-engineering.git"
        id                          = "operations-engineering"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "operations-engineering"
        node_id                     = "MDEwOlJlcG9zaXRvcnkyMjMzODUwNDE="
        primary_language            = "Python"
        private                     = false
        repo_id                     = 223385041
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:ministryofjustice/operations-engineering.git"
        svn_url                     = "https://github.com/ministryofjustice/operations-engineering"
        topics                      = [
            "issue-tracker",
            "operations-engineering",
            "python",
        ]
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        pages {
            build_type = "workflow"
            custom_404 = false
            html_url   = "https://ministryofjustice.github.io/operations-engineering/"
            status     = "built"
            url        = "https://api.github.com/repos/ministryofjustice/operations-engineering/pages"

            source {
                branch = "main"
                path   = "/"
            }
        }

        security_and_analysis {
            secret_scanning {
                status = "enabled"
            }
            secret_scanning_push_protection {
                status = "enabled"
            }
        }
    }

  # module.ministryofjustice.module.operations-engineering.github_team_repository.admin["4192115"] will be imported
    resource "github_team_repository" "admin" {
        etag       = "W/\"3c6fed18d828a54fd232c1650e6ce1505df27ea8f4543f66faa8b227cb5e79c4\""
        id         = "4192115:operations-engineering"
        permission = "admin"
        repository = "operations-engineering"
        team_id    = "4192115"
    }

  # module.ministryofjustice.module.operations-engineering-certificate-renewal.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "operations-engineering-certificate-renewal"
    }

  # module.ministryofjustice.module.operations-engineering-certificate-renewal.github_repository.default will be updated in-place
  # (imported from "operations-engineering-certificate-renewal")
  ~ resource "github_repository" "default" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        allow_update_branch         = false
      + archive_on_destroy          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "main"
        delete_branch_on_merge      = true
        description                 = "An application to automatically manage the renewal of certificates, and notify when certificates are close to expiring. • This repository is defined and managed in Terraform"
        etag                        = "W/\"be41e966257eb006550379e7e6bc9cb28dcd7f0ca69b5898b76d0d1357e5ef20\""
        full_name                   = "ministryofjustice/operations-engineering-certificate-renewal"
        git_clone_url               = "git://github.com/ministryofjustice/operations-engineering-certificate-renewal.git"
        has_discussions             = false
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
        has_wiki                    = true
        html_url                    = "https://github.com/ministryofjustice/operations-engineering-certificate-renewal"
        http_clone_url              = "https://github.com/ministryofjustice/operations-engineering-certificate-renewal.git"
        id                          = "operations-engineering-certificate-renewal"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "operations-engineering-certificate-renewal"
        node_id                     = "R_kgDOI-HjhQ"
        primary_language            = "Python"
        private                     = false
        repo_id                     = 602006405
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:ministryofjustice/operations-engineering-certificate-renewal.git"
        svn_url                     = "https://github.com/ministryofjustice/operations-engineering-certificate-renewal"
        topics                      = [
            "operations-engineering",
        ]
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "enabled"
            }
            secret_scanning_push_protection {
                status = "enabled"
            }
        }

        template {
            include_all_branches = false
            owner                = "ministryofjustice"
            repository           = "template-repository"
        }
    }

  # module.ministryofjustice.module.operations-engineering-certificate-renewal.github_team_repository.admin["4192115"] will be imported
    resource "github_team_repository" "admin" {
        etag       = "W/\"52ff1bfa04d2b0a5047e8e8c666a4dee65bbd14939f77ad61bd95e617b54d5b2\""
        id         = "4192115:operations-engineering-certificate-renewal"
        permission = "admin"
        repository = "operations-engineering-certificate-renewal"
        team_id    = "4192115"
    }

  # module.ministryofjustice.module.operations-engineering-cloud-platform-namespace.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "operations-engineering-cloud-platform-namespace"
    }

  # module.ministryofjustice.module.operations-engineering-cloud-platform-namespace.github_repository.default will be updated in-place
  # (imported from "operations-engineering-cloud-platform-namespace")
  ~ resource "github_repository" "default" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        allow_update_branch         = false
      + archive_on_destroy          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "main"
        delete_branch_on_merge      = true
        description                 = "This repository contains the terraform code for an operations engineering namespace in the cloud platform • This repository is defined and managed in Terraform"
        etag                        = "W/\"8c6221718ef5546da32371d6db2e6f2a27090e7fd420d5a0cec272272b6378db\""
        full_name                   = "ministryofjustice/operations-engineering-cloud-platform-namespace"
        git_clone_url               = "git://github.com/ministryofjustice/operations-engineering-cloud-platform-namespace.git"
        has_discussions             = false
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
        has_wiki                    = true
        html_url                    = "https://github.com/ministryofjustice/operations-engineering-cloud-platform-namespace"
        http_clone_url              = "https://github.com/ministryofjustice/operations-engineering-cloud-platform-namespace.git"
        id                          = "operations-engineering-cloud-platform-namespace"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "operations-engineering-cloud-platform-namespace"
        node_id                     = "R_kgDOMwMInw"
        primary_language            = "HCL"
        private                     = false
        repo_id                     = 855836831
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:ministryofjustice/operations-engineering-cloud-platform-namespace.git"
        svn_url                     = "https://github.com/ministryofjustice/operations-engineering-cloud-platform-namespace"
        topics                      = [
            "operations-engineering",
        ]
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "enabled"
            }
            secret_scanning_push_protection {
                status = "enabled"
            }
        }

        template {
            include_all_branches = false
            owner                = "ministryofjustice"
            repository           = "template-repository"
        }
    }

  # module.ministryofjustice.module.operations-engineering-cloud-platform-namespace.github_team_repository.admin["4192115"] will be imported
    resource "github_team_repository" "admin" {
        etag       = "W/\"5b6bbfadfd5f82c53556d3b009af592f89259c189132f588ac327a5b6e43e0d5\""
        id         = "4192115:operations-engineering-cloud-platform-namespace"
        permission = "admin"
        repository = "operations-engineering-cloud-platform-namespace"
        team_id    = "4192115"
    }

  # module.ministryofjustice.module.operations-engineering-documentation-browser-extension.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "operations-engineering-documentation-browser-extension"
    }

  # module.ministryofjustice.module.operations-engineering-documentation-browser-extension.github_repository.default will be updated in-place
  # (imported from "operations-engineering-documentation-browser-extension")
  ~ resource "github_repository" "default" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        allow_update_branch         = false
      + archive_on_destroy          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "main"
        delete_branch_on_merge      = true
        description                 = "A browser extension to easily find documentation for building MoJ Digital Services • This repository is defined and managed in Terraform"
        etag                        = "W/\"f68a60f64608d30bf35162b7017cb448264a0cca81cda27be818011d44766169\""
        full_name                   = "ministryofjustice/operations-engineering-documentation-browser-extension"
        git_clone_url               = "git://github.com/ministryofjustice/operations-engineering-documentation-browser-extension.git"
        has_discussions             = false
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
        has_wiki                    = true
        html_url                    = "https://github.com/ministryofjustice/operations-engineering-documentation-browser-extension"
        http_clone_url              = "https://github.com/ministryofjustice/operations-engineering-documentation-browser-extension.git"
        id                          = "operations-engineering-documentation-browser-extension"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "operations-engineering-documentation-browser-extension"
        node_id                     = "R_kgDOK636CA"
        primary_language            = "HTML"
        private                     = false
        repo_id                     = 732822024
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:ministryofjustice/operations-engineering-documentation-browser-extension.git"
        svn_url                     = "https://github.com/ministryofjustice/operations-engineering-documentation-browser-extension"
        topics                      = [
            "operations-engineering",
        ]
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "enabled"
            }
            secret_scanning_push_protection {
                status = "enabled"
            }
        }

        template {
            include_all_branches = false
            owner                = "ministryofjustice"
            repository           = "template-repository"
        }
    }

  # module.ministryofjustice.module.operations-engineering-documentation-browser-extension.github_team_repository.admin["4192115"] will be imported
    resource "github_team_repository" "admin" {
        etag       = "W/\"589650250b15da9dafe0fc1a34d8069ea207a9c7761667ed0e2dcb8ba8d1b934\""
        id         = "4192115:operations-engineering-documentation-browser-extension"
        permission = "admin"
        repository = "operations-engineering-documentation-browser-extension"
        team_id    = "4192115"
    }

  # module.ministryofjustice.module.operations-engineering-find-a-github-repository-owner.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "operations-engineering-find-a-github-repository-owner"
    }

  # module.ministryofjustice.module.operations-engineering-find-a-github-repository-owner.github_repository.default will be updated in-place
  # (imported from "operations-engineering-find-a-github-repository-owner")
  ~ resource "github_repository" "default" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        allow_update_branch         = false
      + archive_on_destroy          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "main"
        delete_branch_on_merge      = true
        description                 = "Find Owners of GitHub Reposistories • This repository is defined and managed in Terraform"
        etag                        = "W/\"29ed8ef0e000bdc2184dec585d32219c95c25ee4a850d86dc1fe596eb4b19496\""
        full_name                   = "ministryofjustice/operations-engineering-find-a-github-repository-owner"
        git_clone_url               = "git://github.com/ministryofjustice/operations-engineering-find-a-github-repository-owner.git"
        has_discussions             = false
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
        has_wiki                    = true
        html_url                    = "https://github.com/ministryofjustice/operations-engineering-find-a-github-repository-owner"
        http_clone_url              = "https://github.com/ministryofjustice/operations-engineering-find-a-github-repository-owner.git"
        id                          = "operations-engineering-find-a-github-repository-owner"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "operations-engineering-find-a-github-repository-owner"
        node_id                     = "R_kgDOManiYw"
        primary_language            = "Python"
        private                     = false
        repo_id                     = 833217123
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:ministryofjustice/operations-engineering-find-a-github-repository-owner.git"
        svn_url                     = "https://github.com/ministryofjustice/operations-engineering-find-a-github-repository-owner"
        topics                      = [
            "operations-engineering",
        ]
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "enabled"
            }
            secret_scanning_push_protection {
                status = "enabled"
            }
        }

        template {
            include_all_branches = false
            owner                = "ministryofjustice"
            repository           = "template-repository"
        }
    }

  # module.ministryofjustice.module.operations-engineering-find-a-github-repository-owner.github_team_repository.admin["4192115"] will be imported
    resource "github_team_repository" "admin" {
        etag       = "W/\"ca0c52ef97dbc8ac6ec8da322adf7af52bc10fa053685fd15bd15e2a0aec50f3\""
        id         = "4192115:operations-engineering-find-a-github-repository-owner"
        permission = "admin"
        repository = "operations-engineering-find-a-github-repository-owner"
        team_id    = "4192115"
    }

  # module.ministryofjustice.module.operations-engineering-github-actions-dashboard.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "operations-engineering-github-actions-dashboard"
    }

  # module.ministryofjustice.module.operations-engineering-github-actions-dashboard.github_repository.default will be updated in-place
  # (imported from "operations-engineering-github-actions-dashboard")
  ~ resource "github_repository" "default" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        allow_update_branch         = false
      + archive_on_destroy          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "main"
        delete_branch_on_merge      = true
        description                 = "A GitHub repository for the Operations Engineering GitHub Actions dashboard • This repository is defined and managed in Terraform"
        etag                        = "W/\"f1ba813b0823ac5cc231717f5393fdc5e20c48a0330c8dcb9fd25f4394e7e808\""
        full_name                   = "ministryofjustice/operations-engineering-github-actions-dashboard"
        git_clone_url               = "git://github.com/ministryofjustice/operations-engineering-github-actions-dashboard.git"
        has_discussions             = false
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
        has_wiki                    = true
        html_url                    = "https://github.com/ministryofjustice/operations-engineering-github-actions-dashboard"
        http_clone_url              = "https://github.com/ministryofjustice/operations-engineering-github-actions-dashboard.git"
        id                          = "operations-engineering-github-actions-dashboard"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "operations-engineering-github-actions-dashboard"
        node_id                     = "R_kgDOMRCOOA"
        private                     = false
        repo_id                     = 823168568
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:ministryofjustice/operations-engineering-github-actions-dashboard.git"
        svn_url                     = "https://github.com/ministryofjustice/operations-engineering-github-actions-dashboard"
        topics                      = [
            "operations-engineering",
            "poc",
        ]
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "enabled"
            }
            secret_scanning_push_protection {
                status = "enabled"
            }
        }

        template {
            include_all_branches = false
            owner                = "ministryofjustice"
            repository           = "template-repository"
        }
    }

  # module.ministryofjustice.module.operations-engineering-github-actions-dashboard.github_team_repository.admin["4192115"] will be imported
    resource "github_team_repository" "admin" {
        etag       = "W/\"c9484ddac28f0fccd3397958da491536f9226af975eab4e4b34002f5d9605b08\""
        id         = "4192115:operations-engineering-github-actions-dashboard"
        permission = "admin"
        repository = "operations-engineering-github-actions-dashboard"
        team_id    = "4192115"
    }

  # module.ministryofjustice.module.operations-engineering-kpi-dashboard.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "operations-engineering-kpi-dashboard"
    }

  # module.ministryofjustice.module.operations-engineering-kpi-dashboard.github_repository.default will be updated in-place
  # (imported from "operations-engineering-kpi-dashboard")
  ~ resource "github_repository" "default" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        allow_update_branch         = false
      + archive_on_destroy          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "main"
        delete_branch_on_merge      = true
        description                 = "Display KPI metrics of processes and services • This repository is defined and managed in Terraform"
        etag                        = "W/\"ec1e00f63435c21dbdbd1c0e9438b37bbf120cbe39de048f9fb347666b402aae\""
        full_name                   = "ministryofjustice/operations-engineering-kpi-dashboard"
        git_clone_url               = "git://github.com/ministryofjustice/operations-engineering-kpi-dashboard.git"
        has_discussions             = false
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
        has_wiki                    = true
        homepage_url                = "https://kpi-dashboard.cloud-platform.service.justice.gov.uk/dashboard"
        html_url                    = "https://github.com/ministryofjustice/operations-engineering-kpi-dashboard"
        http_clone_url              = "https://github.com/ministryofjustice/operations-engineering-kpi-dashboard.git"
        id                          = "operations-engineering-kpi-dashboard"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "operations-engineering-kpi-dashboard"
        node_id                     = "R_kgDOL1tpxg"
        primary_language            = "Python"
        private                     = false
        repo_id                     = 794520006
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:ministryofjustice/operations-engineering-kpi-dashboard.git"
        svn_url                     = "https://github.com/ministryofjustice/operations-engineering-kpi-dashboard"
        topics                      = [
            "operations-engineering",
        ]
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "enabled"
            }
            secret_scanning_push_protection {
                status = "enabled"
            }
        }

        template {
            include_all_branches = false
            owner                = "ministryofjustice"
            repository           = "template-repository"
        }
    }

  # module.ministryofjustice.module.operations-engineering-kpi-dashboard.github_team_repository.admin["4192115"] will be imported
    resource "github_team_repository" "admin" {
        etag       = "W/\"c6cc97cba66bbca14677877f35259c4b91874895616a7b019dcd8cd73675c08d\""
        id         = "4192115:operations-engineering-kpi-dashboard"
        permission = "admin"
        repository = "operations-engineering-kpi-dashboard"
        team_id    = "4192115"
    }

  # module.ministryofjustice.module.operations-engineering-runbooks.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "operations-engineering-runbooks"
    }

  # module.ministryofjustice.module.operations-engineering-runbooks.github_repository.default will be updated in-place
  # (imported from "operations-engineering-runbooks")
  ~ resource "github_repository" "default" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        allow_update_branch         = false
      + archive_on_destroy          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "main"
        delete_branch_on_merge      = true
        description                 = "Runbook documentation for Operations Engineering • This repository is defined and managed in Terraform"
        etag                        = "W/\"fe91a8f112c1b172465382847e783d4880442de6788c4c12d847ec92e9ca5b8a\""
        full_name                   = "ministryofjustice/operations-engineering-runbooks"
        git_clone_url               = "git://github.com/ministryofjustice/operations-engineering-runbooks.git"
        has_discussions             = false
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
        has_wiki                    = true
        homepage_url                = "https://runbooks.operations-engineering.service.justice.gov.uk/"
        html_url                    = "https://github.com/ministryofjustice/operations-engineering-runbooks"
        http_clone_url              = "https://github.com/ministryofjustice/operations-engineering-runbooks.git"
        id                          = "operations-engineering-runbooks"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "operations-engineering-runbooks"
        node_id                     = "R_kgDOKK8OCQ"
        primary_language            = "HTML"
        private                     = false
        repo_id                     = 682561033
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:ministryofjustice/operations-engineering-runbooks.git"
        svn_url                     = "https://github.com/ministryofjustice/operations-engineering-runbooks"
        topics                      = [
            "documentation",
            "operations-engineering",
        ]
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        pages {
            build_type = "workflow"
            cname      = "runbooks.operations-engineering.service.justice.gov.uk"
            custom_404 = false
            html_url   = "https://runbooks.operations-engineering.service.justice.gov.uk/"
            url        = "https://api.github.com/repos/ministryofjustice/operations-engineering-runbooks/pages"

            source {
                branch = "main"
                path   = "/"
            }
        }

        security_and_analysis {
            secret_scanning {
                status = "enabled"
            }
            secret_scanning_push_protection {
                status = "enabled"
            }
        }

        template {
            include_all_branches = false
            owner                = "ministryofjustice"
            repository           = "template-repository"
        }
    }

  # module.ministryofjustice.module.operations-engineering-runbooks.github_team_repository.admin["4192115"] will be imported
    resource "github_team_repository" "admin" {
        etag       = "W/\"f4c6e3affe4ef4e1b8e0b5b6a1d4c3c1cc79101bdfc4fef60f955405997db93a\""
        id         = "4192115:operations-engineering-runbooks"
        permission = "admin"
        repository = "operations-engineering-runbooks"
        team_id    = "4192115"
    }

  # module.ministryofjustice.module.operations-engineering-support-metadata.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "operations-engineering-support-metadata"
    }

  # module.ministryofjustice.module.operations-engineering-support-metadata.github_repository.default will be updated in-place
  # (imported from "operations-engineering-support-metadata")
  ~ resource "github_repository" "default" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        allow_update_branch         = false
      + archive_on_destroy          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "main"
        delete_branch_on_merge      = true
        description                 = "This repository contains the data and tools for reporting Oerations Engineering support requests. • This repository is defined and managed in Terraform"
        etag                        = "W/\"ed82aebe3382f5679d73ff11d0502bf798b6d1432de1af4fd1d4194ad3393b5f\""
        full_name                   = "ministryofjustice/operations-engineering-support-metadata"
        git_clone_url               = "git://github.com/ministryofjustice/operations-engineering-support-metadata.git"
        has_discussions             = true
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
        has_wiki                    = true
        homepage_url                = "https://operations-engineering-upport-metadata.operations-engineering.service.justice.gov.uk/"
        html_url                    = "https://github.com/ministryofjustice/operations-engineering-support-metadata"
        http_clone_url              = "https://github.com/ministryofjustice/operations-engineering-support-metadata.git"
        id                          = "operations-engineering-support-metadata"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "operations-engineering-support-metadata"
        node_id                     = "R_kgDOLWBtdg"
        primary_language            = "Python"
        private                     = false
        repo_id                     = 761294198
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:ministryofjustice/operations-engineering-support-metadata.git"
        svn_url                     = "https://github.com/ministryofjustice/operations-engineering-support-metadata"
        topics                      = [
            "operations-engineering",
        ]
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "enabled"
            }
            secret_scanning_push_protection {
                status = "enabled"
            }
        }

        template {
            include_all_branches = false
            owner                = "ministryofjustice"
            repository           = "template-repository"
        }
    }

  # module.ministryofjustice.module.operations-engineering-support-metadata.github_team_repository.admin["4192115"] will be imported
    resource "github_team_repository" "admin" {
        etag       = "W/\"6875a15ff1ecd38703fee4894f5fe17b50d2f130f16ccff03e469e313e7bcb34\""
        id         = "4192115:operations-engineering-support-metadata"
        permission = "admin"
        repository = "operations-engineering-support-metadata"
        team_id    = "4192115"
    }

  # module.ministryofjustice.module.operations-engineering-user-guide.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "operations-engineering-user-guide"
    }

  # module.ministryofjustice.module.operations-engineering-user-guide.github_repository.default will be updated in-place
  # (imported from "operations-engineering-user-guide")
  ~ resource "github_repository" "default" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        allow_update_branch         = false
      + archive_on_destroy          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "main"
        delete_branch_on_merge      = true
        description                 = "User documentation for Operations Engineering • This repository is defined and managed in Terraform"
        etag                        = "W/\"2b030c8efe28359ec1a39406521aa0362808908a262083f06d82cf6bfd2d0bff\""
        full_name                   = "ministryofjustice/operations-engineering-user-guide"
        git_clone_url               = "git://github.com/ministryofjustice/operations-engineering-user-guide.git"
        has_discussions             = false
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
        has_wiki                    = true
        homepage_url                = "https://user-guide.operations-engineering.service.justice.gov.uk/"
        html_url                    = "https://github.com/ministryofjustice/operations-engineering-user-guide"
        http_clone_url              = "https://github.com/ministryofjustice/operations-engineering-user-guide.git"
        id                          = "operations-engineering-user-guide"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "operations-engineering-user-guide"
        node_id                     = "R_kgDOKCGhmw"
        primary_language            = "HTML"
        private                     = false
        repo_id                     = 673292699
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:ministryofjustice/operations-engineering-user-guide.git"
        svn_url                     = "https://github.com/ministryofjustice/operations-engineering-user-guide"
        topics                      = [
            "documentation",
            "operations-engineering",
            "user-guides",
        ]
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        pages {
            build_type = "workflow"
            cname      = "user-guide.operations-engineering.service.justice.gov.uk"
            custom_404 = false
            html_url   = "https://user-guide.operations-engineering.service.justice.gov.uk/"
            url        = "https://api.github.com/repos/ministryofjustice/operations-engineering-user-guide/pages"

            source {
                branch = "main"
                path   = "/"
            }
        }

        security_and_analysis {
            secret_scanning {
                status = "enabled"
            }
            secret_scanning_push_protection {
                status = "enabled"
            }
        }

        template {
            include_all_branches = false
            owner                = "ministryofjustice"
            repository           = "template-documentation-site"
        }
    }

  # module.ministryofjustice.module.operations-engineering-user-guide.github_team_repository.admin["4192115"] will be imported
    resource "github_team_repository" "admin" {
        etag       = "W/\"e59cfc2b35fdf703744b65087f2fb60fc02bc74bed4742c702895854ed52b902\""
        id         = "4192115:operations-engineering-user-guide"
        permission = "admin"
        repository = "operations-engineering-user-guide"
        team_id    = "4192115"
    }

  # module.ministryofjustice.module.terraform-aws-mtasts.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "terraform-aws-mtasts"
    }

  # module.ministryofjustice.module.terraform-aws-mtasts.github_repository.default will be updated in-place
  # (imported from "terraform-aws-mtasts")
  ~ resource "github_repository" "default" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        allow_update_branch         = false
      + archive_on_destroy          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "main"
        delete_branch_on_merge      = true
        description                 = "MTA-STS/TLS-RPT AWS Terraform Module • This repository is defined and managed in Terraform"
        etag                        = "W/\"15ea24282387d763d15b539ea3aad3a996df783bee282b13242a7d703fd2496b\""
        full_name                   = "ministryofjustice/terraform-aws-mtasts"
        git_clone_url               = "git://github.com/ministryofjustice/terraform-aws-mtasts.git"
        has_discussions             = false
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
        has_wiki                    = false
        html_url                    = "https://github.com/ministryofjustice/terraform-aws-mtasts"
        http_clone_url              = "https://github.com/ministryofjustice/terraform-aws-mtasts.git"
        id                          = "terraform-aws-mtasts"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "terraform-aws-mtasts"
        node_id                     = "R_kgDOHWUugg"
        primary_language            = "HCL"
        private                     = false
        repo_id                     = 493170306
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:ministryofjustice/terraform-aws-mtasts.git"
        svn_url                     = "https://github.com/ministryofjustice/terraform-aws-mtasts"
        topics                      = [
            "operations-engineering",
        ]
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "enabled"
            }
            secret_scanning_push_protection {
                status = "enabled"
            }
        }
    }

  # module.ministryofjustice.module.terraform-aws-mtasts.github_team_repository.admin["4192115"] will be imported
    resource "github_team_repository" "admin" {
        etag       = "W/\"f0112c1e1d1e8c373a4d6e3e7858d9d7f0a14d6e569971a3b90f4edf1844d7c1\""
        id         = "4192115:terraform-aws-mtasts"
        permission = "admin"
        repository = "terraform-aws-mtasts"
        team_id    = "4192115"
    }

  # module.ministryofjustice.module.terraform-github-repository.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "terraform-github-repository"
    }

  # module.ministryofjustice.module.terraform-github-repository.github_repository.default will be updated in-place
  # (imported from "terraform-github-repository")
  ~ resource "github_repository" "default" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        allow_update_branch         = false
      + archive_on_destroy          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "main"
        delete_branch_on_merge      = true
        description                 = "A Terraform module for GitHub repositories in the Ministry of Justice • This repository is defined and managed in Terraform"
        etag                        = "W/\"8caca388552008329a220f4b02ee27ae8a1d735b0298d52fecf8a0b5347cde95\""
        full_name                   = "ministryofjustice/terraform-github-repository"
        git_clone_url               = "git://github.com/ministryofjustice/terraform-github-repository.git"
        has_discussions             = true
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
        has_wiki                    = false
        html_url                    = "https://github.com/ministryofjustice/terraform-github-repository"
        http_clone_url              = "https://github.com/ministryofjustice/terraform-github-repository.git"
        id                          = "terraform-github-repository"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "terraform-github-repository"
        node_id                     = "R_kgDOLELUgg"
        primary_language            = "HCL"
        private                     = false
        repo_id                     = 742577282
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:ministryofjustice/terraform-github-repository.git"
        svn_url                     = "https://github.com/ministryofjustice/terraform-github-repository"
        topics                      = [
            "github",
            "operations-engineering",
            "terraform",
            "terraform-module",
        ]
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "enabled"
            }
            secret_scanning_push_protection {
                status = "enabled"
            }
        }

        template {
            include_all_branches = false
            owner                = "ministryofjustice"
            repository           = "modernisation-platform-terraform-module-template"
        }
    }

  # module.ministryofjustice.module.terraform-github-repository.github_team_repository.admin["4192115"] will be imported
    resource "github_team_repository" "admin" {
        etag       = "W/\"8c4a531df631f20b392a01a844ee7ace67d20f67d98314016e98a4a877e84eb0\""
        id         = "4192115:terraform-github-repository"
        permission = "admin"
        repository = "terraform-github-repository"
        team_id    = "4192115"
    }

  # module.ministryofjustice-test.module.test-repo-levg.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "test-repo-levg"
    }

  # module.ministryofjustice-test.module.test-repo-levg.github_repository.default will be updated in-place
  # (imported from "test-repo-levg")
  ~ resource "github_repository" "default" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        allow_update_branch         = false
      + archive_on_destroy          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "main"
        delete_branch_on_merge      = true
        description                 = "test repo • This repository is defined and managed in Terraform"
        etag                        = "W/\"2c7778f1c0666eb8afc417d04c67fece0881682e8293b741632a863c696beddb\""
        full_name                   = "ministryofjustice-test/test-repo-levg"
        git_clone_url               = "git://github.com/ministryofjustice-test/test-repo-levg.git"
        has_discussions             = false
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
        has_wiki                    = true
        html_url                    = "https://github.com/ministryofjustice-test/test-repo-levg"
        http_clone_url              = "https://github.com/ministryofjustice-test/test-repo-levg.git"
        id                          = "test-repo-levg"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "test-repo-levg"
        node_id                     = "R_kgDOLPRAVQ"
        private                     = false
        repo_id                     = 754204757
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:ministryofjustice-test/test-repo-levg.git"
        svn_url                     = "https://github.com/ministryofjustice-test/test-repo-levg"
        topics                      = [
            "operations-engineering",
        ]
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "enabled"
            }
            secret_scanning_push_protection {
                status = "enabled"
            }
        }

        template {
            include_all_branches = false
            owner                = "ministryofjustice"
            repository           = "template-repository"
        }
    }

  # module.ministryofjustice-test.module.test_tamf_repo_test_org.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "test-tamf-repo-test-org"
    }

  # module.ministryofjustice-test.module.test_tamf_repo_test_org.github_branch_protection.default must be replaced
  # (imported from "R_kgDOLRPf2Q:main")
  # Warning: this will destroy the imported resource
-/+ resource "github_branch_protection" "default" {
        allows_deletions                = false
        allows_force_pushes             = false
        blocks_creations                = false
        enforce_admins                  = true
      - force_push_bypassers            = [] -> null
      ~ id                              = "BPR_kwDOLRPf2c4Cyrgo" -> (known after apply)
        lock_branch                     = false
        pattern                         = "main"
      - push_restrictions               = [] -> null
      ~ repository_id                   = "R_kgDOLRPf2Q" -> "test-tamf-repo-test-org" # forces replacement
        require_conversation_resolution = false
        require_signed_commits          = false
        required_linear_history         = false

      ~ required_pull_request_reviews {
            dismiss_stale_reviews           = true
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
            require_code_owner_reviews      = true
            require_last_push_approval      = false
            required_approving_review_count = 1
          - restrict_dismissals             = false -> null
        }

      ~ required_status_checks {
          - contexts = [] -> null
            strict   = false
        }
    }

  # module.ministryofjustice-test.module.test_tamf_repo_test_org.github_repository.default will be updated in-place
  # (imported from "test-tamf-repo-test-org")
  ~ resource "github_repository" "default" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        allow_update_branch         = false
      + archive_on_destroy          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "main"
        delete_branch_on_merge      = true
        description                 = "Test repo to test new module input team_access • This repository is defined and managed in Terraform"
        etag                        = "W/\"d7aa5e576f35c7015b527a710f145211048df7df501b4f4168ef50cf45697714\""
        full_name                   = "ministryofjustice-test/test-tamf-repo-test-org"
        git_clone_url               = "git://github.com/ministryofjustice-test/test-tamf-repo-test-org.git"
        has_discussions             = false
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
        has_wiki                    = true
        html_url                    = "https://github.com/ministryofjustice-test/test-tamf-repo-test-org"
        http_clone_url              = "https://github.com/ministryofjustice-test/test-tamf-repo-test-org.git"
        id                          = "test-tamf-repo-test-org"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "test-tamf-repo-test-org"
        node_id                     = "R_kgDOLRPf2Q"
        primary_language            = "Python"
        private                     = false
        repo_id                     = 756277209
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:ministryofjustice-test/test-tamf-repo-test-org.git"
        svn_url                     = "https://github.com/ministryofjustice-test/test-tamf-repo-test-org"
        topics                      = [
            "operations-engineering",
        ]
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "enabled"
            }
            secret_scanning_push_protection {
                status = "enabled"
            }
        }

        template {
            include_all_branches = false
            owner                = "ministryofjustice"
            repository           = "template-repository"
        }
    }

  # module.ministryofjustice-test.module.test_tamf_repo_test_org.github_team_repository.maintain["9456244"] will be imported
    resource "github_team_repository" "maintain" {
        etag       = "W/\"7e9e17732f8212d0c881b6759a037b0c7c7b009588e076951838f268dc565a0c\""
        id         = "9456244:test-tamf-repo-test-org"
        permission = "maintain"
        repository = "test-tamf-repo-test-org"
        team_id    = "9456244"
    }

  # module.ministryofjustice-test.module.test_tamf_repo_test_org.github_team_repository.push["9472191"] will be imported
    resource "github_team_repository" "push" {
        etag       = "W/\"fdafbf69a27ce919780b568eedb40679d33ee557fe3081d27f8934fbcc328904\""
        id         = "9472191:test-tamf-repo-test-org"
        permission = "push"
        repository = "test-tamf-repo-test-org"
        team_id    = "9472191"
    }

Plan: 31 to import, 1 to add, 15 to change, 1 to destroy.

```